<?php
class Model_Order_Payment_Returncode_Allpay {
    //授權碼
    static $code = array(
        '1' => '交易成功',
        '10100001' => 'IP 拒絕存取',
        '10100002' => '交易發生錯誤',
        '10100050' => '參數錯誤',
        '10100051' => 'XML參數或格式錯誤',
        '10100052' => '特店編號錯誤',
        '10100053' => '特店狀態錯誤',
        '10100054' => '廠商交易序號重複',
        '10100055' => '新增交易失敗',
        '10100056' => '交易編號有誤',
        '10100058' => '付款失敗',
        '10100059' => '找不到交易序號',
        '10100060' => '特店編號空白',
        '10100061' => '回傳網址空白',
        '10100062' => '特店編號錯誤',
        '10100063' => '特店交易編號空白',
        '10100064' => '交易日期格式錯誤',
        '10100065' => '交易金額格式錯誤',
        '10100066' => '交易描述空白',
        '10100067' => '編碼格式空白',
        '10100068' => '交易金額不符',
        '10100113' => 'GwID Is Error.',
    );
}
